export default {
  title: 'مجتمع openEuler يحترم خصوصيتك',
  desc: 'يستخدم هذا الموقع ملفات الارتباط التشعبي التي نقدمها نحن وشركاؤنا لتحسين تجربة تصفحك وجعل الموقع يعمل على النحو الصحيح. بالنقر على "قبول الكل"، فإنك توافق على استخدام ملفات الارتباط التشعبي. بالنقر على "رفض الكل"، فأنت تعطل استخدام ملفات الارتباط التشعبي غير الضرورية. يمكنك إدارة إعدادات ملفات الارتباط التشعبي بالنقر على "إدارة ملفات الارتباط التشعبي". للحصول على مزيد من المعلومات أو لتغيير إعدادات ملفات الارتباط التشعبي، يُرجى الرجوع إلى ',
  link: 'حول ملفات الارتباط التشعبي.',
  acceptAll: 'قبول الكل',
  rejectAll: 'رفض الكل',
  manage: 'إدارة ملفات الارتباط التشعبي',
  necessaryCookie: 'ملفات الارتباط التشعبي الضرورية بشدة',
  necessaryCookieTip: 'نشط دائمًا',
  necessaryCookieDetail:
    'ملفات الارتباط التشعبي هذه ضرورية لكي يعمل الموقع على النحو الصحيحح ولا يمكن إيقاف تشغيلها. وعادةً ما يتم تعيينها فقط استجابةً للإجراءات التي اتخذتها والتي ترقى إلى مستوى طلب خدمات، مثل تسجيل الدخول أو ملء النماذج. يمكنك ضبط المتصفح لحظر ملفات الارتباط التشعبي هذه، ولكن ذلك قد يؤدي إلى عدم عمل أجزاء من الموقع. لا تخزن ملفات الارتباط التشعبي هذه أي معلومات شخصية تدلّ على هوية الشخص.',
  analyticalCookie: 'ملفات الارتباط التشعبي التحليلية',
  analyticalCookieDetail:
    'لن نستخدم ملفات الارتباط التشعبي هذه إلا بموافقتك. تساعدنا ملفات الارتباط التشعبي هذه على إجراء تحسينات من خلال جمع إحصاءات مثل عدد الزيارات ومصادر حركة المرور.',
  saveSetting: 'حفظ الإعدادات',
  allowAll: 'قبول الكل',
  setting: 'Cookie Settings',
};
